app/views/home/index.mobile.haml

SELECT `groups`.* FROM `groups`
---
    %ul
        - Group.all.each do |g|