app/controllers/groups_controller.rb

SELECT `groups`.* FROM `groups`
---
  def index
    @groups = Group.all

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---
  def show
    @group = Group.find(params[:id])

INSERT INTO `groups` (`description`, `name`, `created_at`, `updated_at`) VALUES ('Un monton de locos como nosotros', 'Tetuan Valley', '2011-05-11 14:09:19', '2011-05-11 14:09:19')
---
  def create
    @group = Group.new(params[:group])

    respond_to do |format|
      if @group.save